#include<stdio.h> //.h表示头文件.cpp表示源文件 （代码保存为文件后的结果） 

int main()//括号中的viod代表main函数没有参数 ，main函数就是主函数，程序执行总是从main函数开始,由main函数结束。 
{
	int x;//Declaration 声明  
	x=4;//Assignment 赋值 
	int height=5;
	int length=9;
    printf ("size=%d",height*length);//print为打印的意思，f为format格式的意思 
	printf("To C,nottto C:that is the question.\n"); 
	printf("%d\n",x^8);//^的意思为加上 
	printf("1+3=%d\n",1+3);//\n表示换行， 
	printf("1+3=%d\n",4);
    
	printf("\n\
                       8\n\
        88            88\n\
      8888888       8888\n\
    888888888888  888888\n\
  8888@@8888888888888888\n\
    888888888888  888888\n\
      8888888       8888\n\
        88            88\n\
                       8\n");//必须使用\n\换行使前后仍为一个语句，末尾使用\n即可，开头也必须使用\n\ 
	
	printf("\n\
                       8\n\
        88            88\n\
      8888888       8888\n\
    888@88888888  888888\n\
  8888888888888888888888\n\
    --8888888888  888888\n\
      8888888       8888\n\
        88            88\n\
                       8\n");
                       
printf("\n\
   555555555555            55            5555555555555555\n\
        55                 55                   55\n\
    	55            55   55   55       5555555555555555 \n\
      555555         55    55    55      55     55     55 \n\
        55          55     55     55     55 55  55 55  55 \n\
    	55              55 55            55  55 55  55 55 \n\
555555555555555555       5555            55     55     55 \n"  );
	
	
	
	return 0;
}
