#include<stdio.h>
int main(){
int i,j,s=0,l=0;
int a[10]={0,1,2,3,4,5,6,7,8,9};
int b[100],c[100],d[2]={0},o[2]={0};
for(i=0;i<10;i++)
{scanf("%d",&b[i]);}//输入数字0~9对应的个数 
for(i=0;i<10;i++)
{if(b[i]!=0&&a[i]!=0)//判断对应个数不为0且不是数字0的 
{ s++;
  if(s==1)   //找出最小的满足if条件的数字 
  {c[0]=a[i];//数字储存 
   d[1]=b[i];}}//个数储存 
else if(b[i]!=0&&a[i]==0)//判断是否对应个数不为0且是数字0 
  {l=2;               //是令l=2作为下面不同输入的判断标准 
   o[0]=a[i];}        //数字0储存 
}
if(l==0)             //（借留下的标准判断是否有数字0存在）不存在 
{for(j=0;j<10;j++)   
 {for(i=0;i<b[j];i++)
printf("%d",a[j]);}} //直接按从1~9找出有个数的按序输出 
if(l==2)             //数字0存在 
{printf("%d",c[0]);  //先输出一个最小的个数不为0数字 
 for(i=0;i<b[0];i++) //再将0全部输出 
 printf("%d",o[0]);
 for(i=0;i<d[1]-1;i++)//再输出剩下的最小数字c 
 printf("%d",c[0]);
 for(j=0;j<10;j++)//然后将剩下有个数的数字按顺序输出 
{for(i=0;i<b[j]&&a[j]!=0&&a[j]!=c[0];i++)
 printf("%d",a[j]);}
}
} 
